a5021/stm32-async-1wire/src/ds18b20.c
/** @brief Global search context instance */
static search_ctx_t s;

/**
 * @brief Start a non-blocking device search
 * @param[in] sink Callback invoked per found DS18B20 device (may be NULL)
 * @param[in] max_devices Maximum number of devices to report (0 aborts)
 */
void ds18b20_search_start(ds18b20_search_sink_t sink, uint8_t max_devices) {
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        s.rom[i] = 0;
    }
    s.sink = sink;
    s.max = max_devices;
    s.found = 0;
    s.finished = 0;
    s.last_discrepancy = 0;
    if (max_devices == 0) {
        s.phase = DS18B20_SEARCH_DONE;
        return;
    }
    s.phase = DS18B20_SEARCH_RESET;
    ds18b20_bus_reset(); // Schedule the first hardware operation
}

/**
 * @brief Advance the non-blocking device search
 * @return 1 when the search is finished, 0 while still running
 */
uint8_t ds18b20_search_poll(void) {
    if (s.finished) {
        return 1;
    }

    if (s.phase == DS18B20_SEARCH_DONE) {
        // No hardware operation is pending at the end of the search: hand the
        // timer back to the measurement state machine exactly once.
        ds18b20_restore();
        s.finished = 1;
        return 1;
    }

    // Wait for the currently scheduled hardware operation to complete.
    // This is a non-blocking poll, not a busy-wait.
    if (!ds18b20_bus_done()) {
        return 0;
    }

    switch (s.phase) {
    case DS18B20_SEARCH_RESET:
        // Reset completed: a presence pulse means at least one device is on
        // the bus, so start a new search pass with the Search ROM command.
        if (!ds18b20_bus_present()) {
            s.phase = DS18B20_SEARCH_DONE;
            break;
        }
        ds18b20_bus_encode_byte(s.pulses, DS18B20_SEARCH_ROM);
        ds18b20_bus_write_slots(s.pulses, DS18B20_BITS_PER_BYTE);
        s.phase = DS18B20_SEARCH_CMD;
        break;

    case DS18B20_SEARCH_CMD:
        // 0xF0 sent: prepare the first bit iteration and read the id/cmp pair.
        s.id_bit_number = 1;
        s.last_zero = 0;
        ds18b20_bus_read_pair();
        s.phase = DS18B20_SEARCH_READ_PAIR;
        break;

    case DS18B20_SEARCH_READ_PAIR: {
        const uint8_t byte_idx = (s.id_bit_number - 1) / DS18B20_BITS_PER_BYTE;
        const uint8_t mask = (uint8_t)(1u << ((s.id_bit_number - 1) % DS18B20_BITS_PER_BYTE));
        const uint8_t id_bit = ds18b20_bus_pair_id();
        const uint8_t cmp_bit = ds18b20_bus_pair_cmp();
        uint8_t direction;

        if (id_bit && cmp_bit) {
            // No device follows this path - search tree exhausted
            s.phase = DS18B20_SEARCH_DONE;
            break;
        }
        if (id_bit != cmp_bit) {
            // Single device on this path - its bit fixes the direction
            direction = id_bit;
        } else if (s.id_bit_number < s.last_discrepancy) {
            // Follow the previously taken path
            direction = (s.rom[byte_idx] & mask) ? 1u : 0u;
            if (direction == 0) {
                // Remember the last 0-branch taken at a discrepancy
                s.last_zero = s.id_bit_number;
            }
        } else {
            // At the discrepancy point take the '1' branch first
            direction = (s.id_bit_number == s.last_discrepancy) ? 1u : 0u;
            if (direction == 0) {
                // Remember the last 0-branch taken at a discrepancy
                s.last_zero = s.id_bit_number;
            }
        }
        if (direction) {
            s.rom[byte_idx] |= mask;
        } else {
            s.rom[byte_idx] &= (uint8_t)~mask;
        }
        ds18b20_bus_write_bit(direction);
        s.phase = DS18B20_SEARCH_WRITE_DIR;
        break;
    }

    case DS18B20_SEARCH_WRITE_DIR:
        // Direction written: advance to the next bit or finish the device.
        s.id_bit_number++;
        if (s.id_bit_number <= DS18B20_ROM_BITS) {
            ds18b20_bus_read_pair();
            s.phase = DS18B20_SEARCH_READ_PAIR;
            break;
        }

        // All 64 bits of the current ROM assembled - validate it.
        s.last_discrepancy = s.last_zero;
        if (ds18b20_crc8(s.rom, DS18B20_ROM_BYTES) != 0) {
            s.phase = DS18B20_SEARCH_DONE;
            break;
        }
        if (s.rom[0] == DS18B20_FAMILY_CODE) {
            s.found++;
            if (s.sink && s.sink(s.rom)) {
                s.phase = DS18B20_SEARCH_DONE;
                break;
            }
            if (s.found >= s.max) {
                s.phase = DS18B20_SEARCH_DONE;
                break;
            }
        }
        if (s.last_discrepancy == 0) {
            s.phase = DS18B20_SEARCH_DONE;
            break;
        }
        // Another device may exist - run another search pass.
        ds18b20_bus_reset();
        s.phase = DS18B20_SEARCH_RESET;
        break;

    default:
        break;
    }

    return 0;
}

/**
 * @brief Number of DS18B20 devices found (valid once the search finished)
 * @return Count of found devices
 */
uint8_t ds18b20_search_count(void) { return s.found; }

/**
 * @}
 */

/**
 * @defgroup DS18B20_Public_Functions DS18B20 Public Functions
 * @{
 */

/**
 * @brief Initialize DS18B20 driver - configure clocks and peripherals
 */
void ds18b20_init(void) {
    // Enable clocks for required peripherals: GPIOA, TIM1, DMA1
    RC.APB2ENR |= RCC_APB2ENR(IOPAEN, TIM1EN);
    RC.AHBENR |= RCC_AHBENR(DMA1EN);
    // Configure timer prescaler for 1µs resolution (SYSCLK / 1000000 - 1)
    T1.PSC = TIM_PRESCALER;
    T1.EGR = TIM_EGR(UG);
    __DSB();
    T1.BDTR = TIM_BDTR(MOE);
    // Configure PA8 for 1-Wire communication (alternate function open drain)
    PA.CRH |= GPIO_CRH(CNF8_0, CNF8_1, MODE8_1);
}

/**
 * @brief Select which DS18B20 device to measure by its ROM address
 * @param[in] rom Pointer to the 8-byte ROM address (LSB first), or NULL to
 *                return to Skip ROM (broadcast) addressing
 * @note With a non-NULL address, the state machine sends Match ROM (0x55)
 *       plus the device address before each command, so only that device
 *       responds. Pass NULL (or a freshly initialised driver) to keep the
 *       legacy single-sensor Skip ROM behaviour. The address should come from
 *       the non-blocking device search (ds18b20_search_*).
 */
void ds18b20_select(const uint8_t* rom) {
    if (rom == 0) {
        ctx.address_mode = 0;
        return;
    }
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        ctx.selected_rom[i] = rom[i];
    }
    build_addr_prefix(); // Build the invariant Match ROM prefix once per selection
    ctx.address_mode = 1;
}

/**
 * @brief Main state machine function - must be called periodically from main loop
 * @note Non-blocking state machine that advances 1-Wire communication state
 * @note Uses timer update interrupt flag to determine when operations complete
 */
void ds18b20_poll(void) {

    // Check if timer update interrupt occurred (indicates operation completion)
    // This is the non-blocking way to detect when timed operations finish
    if (!(T1.SR & TIM_SR(UIF))) return;
    // Clear timer update interrupt flag
    T1.SR = 0;

    // State machine to manage 1-Wire communication sequence
    switch (ctx.current_state) {
    case 0: // IDLE - Initialize for new measurement cycle
        // Initialize union memory (fills with 0xFF pattern)
        ctx.fill_union = (uint64_t)-1;
        // Transition to START state
        ctx.current_state = 1;
        /* fallthrough to START state immediately */
        /* fallthrough  */

    case 1: // START - Begin measurement cycle, turn on LED
        // Turn on LED to indicate measurement in progress
        ds18b20_busy(!0);
        // Initiate 1-Wire bus reset sequence
        reset_bus();
        // Transition to CONVERT state
        ctx.current_state = 2;
        break;

    case 2: // CONVERT - Check presence and send convert command
        // Verify DS18B20 presence using captured edge timestamps
        if (check_presence()) {
            // Device present - send temperature conversion command,
            // addressing all devices (Skip ROM) or the selected one (Match ROM)
            if (ctx.address_mode) {
                build_addr_cmd(DS18B20_CONVERT_T);
                send_command_n(ctx.addr_cmd, DS18B20_MATCH_SLOTS);
            } else {
                send_command(conv_cmd);
            }
            // Transition to WAIT state to allow conversion time
            ctx.current_state = 3;
        } else {
            // No device present - report error and pause
            ds18b20_complete(DS18B20_TEMP_ERROR_NO_SENSOR);
            // Start inter-measurement pause
            start_cycle_pause();
            // Return to IDLE state
            ctx.current_state = 0;
        }
        break;

    case 3: // WAIT - Wait for temperature conversion to complete
        // Start timer for conversion wait period (750ms typical)
        wait_conversion();
        // Transition to CONTINUE state
        ctx.current_state = 4;
        break;

    case 4: // CONTINUE - Prepare for data readback
        // Initiate second 1-Wire bus reset sequence
        reset_bus();
        // Transition to REQUEST state
        ctx.current_state = 5;
        break;

    case 5: // REQUEST - Check presence and send read command
        // Verify DS18B20 presence again
        if (check_presence()) {
            // Device present - send read scratchpad command,
            // addressing all devices (Skip ROM) or the selected one (Match ROM)
            if (ctx.address_mode) {
                build_addr_cmd(DS18B20_READ_SCRATCHPAD);
                send_command_n(ctx.addr_cmd, DS18B20_MATCH_SLOTS);
            } else {
                send_command(read_cmd);
            }
            // Transition to READ state
            ctx.current_state = 6;
        } else {
            // No device present - report error and pause
            ds18b20_complete(DS18B20_TEMP_ERROR_NO_SENSOR);
            // Start inter-measurement pause
            start_cycle_pause();
            // Return to IDLE state
            ctx.current_state = 0;
        }
        break;

    case 6: // READ - Read scratchpad data from sensor
        // Initiate scratchpad data read using timer capture and DMA
        read_data();
        // Transition to DECODE state
        ctx.current_state = 7;
        break;

    case 7: // DECODE - Process received data and report temperature
        // Decode captured pulse durations into scratchpad bytes
        decode_scratchpad();
        // Turn off LED to indicate measurement complete
        ds18b20_busy(0);

        // Validate CRC and report temperature or error
        if (ctx.scratchpad[8] == check_scratchpad_crc()) {
            // CRC valid - decode and report temperature
            ds18b20_complete(decode_temperature());
        } else {
            // CRC invalid - report error
            ds18b20_complete(DS18B20_TEMP_ERROR_CRC_FAIL);
        }

        // Start inter-measurement pause period
        start_cycle_pause();
        // Return to IDLE state for next measurement cycle
        ctx.current_state = 0;
        break;

    default:
        // Unexpected state - report generic error
        ds18b20_complete(DS18B20_TEMP_ERROR_GENERIC);
        // Return to IDLE state
        ctx.current_state = 0;
        break;
    }
}

/**
 * @}
 */
